BrunoRicci/DataloggerDHT22/Firmware/code_esp8266_dht22/src/main.cpp
#include <Arduino.h>
#include <ArduinoOTA.h>
#include <time.h>

#include <ESP8266WiFi.h>
#include <ESP8266WiFiMulti.h>
#include <ESP8266HTTPClient.h>
#include <WiFiClient.h>
#include <TimeLib.h>

#include <datalogger_config.h>  //Configuration parameters.

#include <Hash.h>
#include <WebServerFiles.cpp>

#include <FS.h>           //SPIFFS libraries.
#include <rtc_memory.hpp>
#include <statemachine.hpp>


//----------------------------------------------------------------------------------------
DHT dht22_sensor_1(DHT_SENSOR_1_PIN, DHTTYPE);    //Creates DHT22 sensor "sensor" object
DHT dht22_sensor_2(DHT_SENSOR_2_PIN, DHTTYPE);    //Creates DHT22 sensor "sensor" object
DHT dht22_sensor_3(DHT_SENSOR_3_PIN, DHTTYPE);    //Creates DHT22 sensor "sensor" object
DHT dht22_sensor_4(DHT_SENSOR_4_PIN, DHTTYPE);    //Creates DHT22 sensor "sensor" object



typedef struct{
  char network_ap_ssid[31];
  char network_ap_pass[31];   
  char server_ip[64];
  uint16_t server_port;
  char local_ip[16];      //192.168.255.255 ->15 + NULL
  char send_measurements_path[64];
  char get_time_path[64];

  char wifi_security_type[10];   //// enum wifi_security_type{WEP, WPA, WPA2, WPA2E};
  
  uint8_t   server_connection_retry;     //amount of retrials to connect in case of failure. (def:1).
  uint32_t  network_connection_timeout;   //milliseconds to try connecting  (def:5000).
  uint32_t  response_timeout;     //milliseconds to await response  (def:2000).
  uint32_t  server_connection_timeout;
  // todo: evaluate which WPA2-Enterprise parameters are needed.
  
  uint16_t id_sensor_a;     //Parameters to put into POST request.
  uint16_t id_sensor_b;
  uint16_t id_sensor_c;
  uint16_t id_sensor_d;
  uint16_t id_transceiver;    

  uint16_t  sample_time;    //lapse between measurements (in seconds)
  uint8_t   connection_time[2]; //[hours][minutes]

  uint8_t operation_mode;
  bool ischarging;
} Config_globals;

typedef struct{
  uint32_t  timestamp;
  uint8_t   battery_level;
  uint8_t   event_type;
  enum EventTypes {POWER_FAIL, FORCE_TURN_OFF, FORCE_MEASUREMENT, CONFIG_MODE} ;
}Logs;

//---------------------------------------------------------------------------------------------------------------------
//Initialization functions.
void portInit(void);
uint8_t getBatteryLevel(void);           //Get battery level percentage (0 to 100%).
void setBatteryState(uint8 state=ON);     //Connects or disconnects battery.
bool checkBattery(void);
void setSensorPower(unsigned char state);
void wifiTurnOn(void);
void wifiTurnOff(void);
void goDeepSleep(uint64_t time);
bool isCharging(void);
bool reedSwitchIsPressed(void);
void dischargeCapacitor(void);
void LED_Color(uint32 color);


void* stringToArray(std::string origin_string);
int32_t generateMeasurementValue(unsigned char type, float value);
String formatMeasurementValue(unsigned char type, float value);  //Converts measurements into valid format
String generatePOSTRequest(void* data, uint16_t packets);
uint16_t sendMeasurements(uint16_t start_packet, uint16_t packets=0);
Measurement getMeasurements(void);
uint32_t getServerTimeUnix(void);
void scheduleConnect(void);

bool writeDataToFlash(String path, void* data, unsigned int bytes);
bool readDataFromFlash(String path, uint32_t index, void* data, unsigned int bytes);
bool archiveWrite(void* data, uint16_t bytes);
uint32_t archiveRead(void* data, uint32_t first_packet, uint32_t packets);
uint32_t archiveGetPointer(void);
bool initglobals(void);
bool saveGlobals(void);
Config_globals readGlobals(void);
bool log_event(uint16_t event_type);
uint16_t read_log(void* data, uint16_t index=0, uint16_t amount=0);

//Functions to handle web server
void handleHome(void);
void handleChangeNetworkConfig(void);
void handleChangeServerConfig(void);
unsigned char runWebServer(void);
unsigned char handleFormatRam(void);
unsigned char handleFormatFlash(void);
unsigned char handleResetSentPointer(void);
unsigned char handleTurnOffDevice(void);
unsigned char handleGetParameters(void);
bool handleChangeConfig(void);

//---------------------------------------------------------------------------------------------------------------------

ESP8266WiFiMulti WiFiMulti;             //Wifi client side handle.
ESP8266WebServer server(8080);          //Server for configuration.
StateMachine statem(STATE_WAKE);  //Create StateMachine class object. Starts at wake.
RtcMemory rtcmem;                       //Object to handle rtc memory.
Config_globals config_globals;
uint32_t idle_time_start;



void setup() {
  wifiTurnOff();
  portInit();
  delay(50);      //Delay 50ms to avoid false "forced-turn on" after boot.
  SPIFFS.begin();
  initglobals();
  config_globals.ischarging = isCharging();

  Serial.begin(115200);
  
  //Checks if device has lost power supply.
  if(rtcmem.checkPowerdown()){
    setBatteryState(ON);  //Connect battery.
    if(rtcmem.initialize())  //Recovers variables
      {Serial.print("\nDevice powered off. RTC memory recovered correctly.");
    // digitalWrite(15,HIGH);      //DEBUG.
      }
    else  
    Serial.print("\n RTC memory recovery failed.");
  }
}


void loop() {

  //Make method to detect if power was disconnected (to automatically call method
  // recoverVariables() and initialize rtc memory properly.)
  
  if(statem.getState() == STATE_WAKE){
    
    if(statem.stateInit()){ //State initialization.
      Serial.print("\n --- State: STATE_WAKE ---");
      wifiTurnOff();
      if(checkBattery()){ //If enough battery remaining...
        /*RTC and external interrupt are not differenced once 
        the device goes into deep sleep. It will always detect 
        as "RTC interrupt".*/

        //Transmission should be controlled by time, not by rtc memory being filled... -> CHANGED!!
        setTime(rtcmem.rwVariables().current_time);
        Serial.print("\nTime now:");
        Serial.printf("\n   %d:%d:%d (UTC)", hour(), minute(), second());
        Serial.printf("\n    %2d/%2d/%4d", day(), month(), year());

        //Show reset reason:
        rst_info *resetinfo;
        resetinfo = ESP.getResetInfoPtr();
        Serial.printf("\n Reset casue: ");
        Serial.println(resetinfo->reason);
        ///////////////////////////////////
        
        if (resetinfo->reason == rst_reason::REASON_DEEP_SLEEP_AWAKE){  //If woke up from deep sleep
          if(reedSwitchIsPressed()){  //if external interrupt (switch was pressed)...
            Serial.print("\n\nExternal interrupt.");
            statem.setState(STATE_FORCE_MEASUREMENT);    //Forces measurement.
          }  
          else{             //If switch was not pressed (RTC interrupt.)
            Serial.print("\n\nRTC interrupt.");
            
              //GMT-3 time                            hours
            if(config_globals.connection_time[0] == hour()){  //FIXME: This only works with hourly wake-up, where this value won't repeat multiple times a day.
                Serial.printf("\nSchedule connection. Hours: %d (UTC)",hour());
                // scheduleConnect();
                statem.setState(STATE_FORCE_MEASUREMENT);
            }
            else{
              statem.setState(STATE_GET_MEASUREMENTS);    //Normal measurement 
            }
          }
        }
        else if (resetinfo->reason == rst_reason::REASON_EXT_SYS_RST){  // If reset while running...
          
          LED_Color(COLOR_VIOLET);
          Serial.flush();
          delay(500);
          String serialdata = Serial.readString();
          uint32_t t;

          if(! serialdata.isEmpty() ){  //If received any data...
            t = serialdata.toInt();
            if (t > 0 && t < 4294967296 ){ //Validate value -> if t=0, the value is not int.
              Serial.print(MSG_SYNC_TIME);
              Serial.printf("\n New time value: %d", t);
              // t -= config_globals.sample_time;  //Substract 1 hour for the hour that will be summed after this deep sleep.
              rtcmem.var.current_time=t;  //Saves updated time.
              rtcmem.rwVariables();
              statem.setState(STATE_FORCE_MEASUREMENT);  //Forces measurement.
            }
            else{ //If data was not integer (string)
              if (serialdata == COMMAND_FORCE_MEASUREMENT)
              {
                Serial.print("\n Force measurement command received.");
                statem.setState(STATE_FORCE_MEASUREMENT);  //Forces measurement.
              }
              else if (serialdata == COMMAND_CONFIG_MODE)
              {
                Serial.print("\n Config mode command received.");
                statem.setState(STATE_CONFIGURATION); //Go to configuration mode.
              }
            }       
          }
          else{
            uint16_t cfg_time_start = millis();
            if (getBatteryLevel() == 100){  //Protection for when it's not connected to USB charger.
              Serial.printf("\n awaiting hold for config mode...");
              while (reedSwitchIsPressed()){
                yield();
                if((millis() - cfg_time_start) >= SWITCH_HOLD_TIME_CONFIG){
                  statem.setState(STATE_CONFIGURATION); //Go to configuration mode.
                  break;
                }
              }
              if((millis() - cfg_time_start) < SWITCH_HOLD_TIME_CONFIG){
                statem.setState(STATE_FORCE_MEASUREMENT);  //Forces measurement.
              }
            }
            else{
              statem.setState(STATE_FORCE_MEASUREMENT);  //Forces measurement.
            }
          }
        }
        else{
          statem.setState(STATE_FORCE_MEASUREMENT);   //Forces measurement -> If reboots for another reason, 
                                                      //connects to server so low battery level can be checked remotely...
        }
      }
      else{ //If out of battery.
        statem.setState(STATE_SEALED);    //Turn off.
      }
    }  
  } 
  else if (statem.getState() == STATE_GET_MEASUREMENTS){
    
    if(statem.stateInit()){
      Serial.print("\n --- State: STATE_GET_MEASUREMENTS ---");

      Serial.print("\n Obtaining measurements... ");
      
      Measurement m = getMeasurements();
    
