BrunoRicci/DataloggerDHT22/Firmware/code_esp8266_dht22/src/main.cpp
    while(n > 0 && request_retries < config_globals.server_connection_retry){   //While there are pending packets...
      
      archiveRead(buf, i,n); //Read "n" packets starting from packet number "i"

      String request = generatePOSTRequest(buf, n); //Generate request with n elements.
      Serial.print("\n[HTTP] POST...:\n");  Serial.print(request);

      http.addHeader("Content-Type", "application/x-www-form-urlencoded");  //Specify content-type header.
      http.addHeader("Accept", "text/html");  //Specify content-type header.
      // http.addHeader("Content-Type", "text/plain");  //Specify content-type header.
      int httpCode = http.POST(request);   //Send the request.
      if(httpCode == 200){
        String payload = http.getString();  
        Serial.print("\n Response:"); Serial.println(payload);  
        http.end(); //for test.
 
        LED_Color(COLOR_GREEN);     //Blink GREEN led.
        delay(50);
        LED_Color(COLOR_BLACK);

        sent_packets_amount += n;   //Increase sent packets counter.

        i += n;  //"i" is now the last read packet.
        n = MAX_PACKET_PER_REQUEST;
        if(i+n > end_packet)    //Limit the amount of packets to read if there are less than the maximum.
          n = end_packet-i; //equal n to que amount of pending packets.
        
        Serial.printf("\n      DATA SENT. Packets pending: %d", end_packet-i);
        Serial.printf("\n  Packets in next request: %d", n);
        Serial.printf("\n  i=%d  /  n=%d\n", i, n);
      }
      else{
        Serial.printf("\n Error. Response code:%d", httpCode);
        LED_Color(COLOR_RED);     //Blink red led.
        delay(100);
        LED_Color(COLOR_BLACK);

        request_retries++;
        if(request_retries < config_globals.server_connection_retry);  //This semicolon should not be here as it inhibits the if...
          Serial.printf("\n HTTP client started: %d",  http.begin(url));   //Specify request destination
      }
      yield();
    }
    
    //Get current time.
    url = "http://"+(String)config_globals.server_ip+":"+(String)config_globals.server_port;
    url+=GET_TIME_PATH;
    Serial.print("\n url: ");   Serial.println(url);
    http.begin(url);
    if(http.GET() == 200){   //If return code is valid
      String payload = http.getString();
      payload = payload.substring(payload.indexOf("\n")+1); //Get only the numeric value.

      if( !payload.isEmpty() ){
        rtcmem.var.current_time = (uint32_t)payload.toInt();
        rtcmem.var.last_sync_time = rtcmem.var.current_time;
        rtcmem.rwVariables();
        Serial.printf("\n UTC time from server: %d\n", rtcmem.rwVariables().last_sync_time);
      }
      else
        Serial.print("\nInvalid time value.");
    }
    else
      Serial.print("\nUnable to obtain time.");
    
    http.end();
    wifiTurnOff();
    return sent_packets_amount;
  }
  else{
    Serial.print("\nConnection timeout.");
    wifiTurnOff();
    LED_Color(COLOR_RED);     //Blink red led.
    yield();
    delay(200);
    LED_Color(COLOR_BLACK);
    LED_Color(COLOR_RED); //Blink red led.
    yield();
    delay(200);
    LED_Color(COLOR_BLACK);

    return 0;
    //Connection failed.
  }


  // Serial.printf("\n Time taken: %dms.", (int)(millis() - start_time)); */
}

uint32_t getServerTimeUnix(void){ //Obsolete!!
  //Cnnects to server, sends a request and returns unix time in UTC from server.
  return 0;
}

void scheduleConnect(void){
  // LED_Color(COLOR_CYAN);
  // Alarm.delay(750);
  // LED_Color(COLOR_BLACK);
  Serial.print("\n- - - - - - - Scheduled alarm. - - - - - - -\n");
  // if(sendMeasurements(0,0)) return true; else return false;
}

int32_t generateMeasurementValue(unsigned char type, float value){
  int32_t measurement=0; 

  if (type == TEMPERATURE){
     // -200 ~ 800 -> -20ºC to 80ºC
     measurement = (int16_t)(value*10);
  }
  else if (type == HUMIDITY)
  { // 0 ~ 100 ->  0% to 100%
    measurement = (uint8_t)(value);
  }
  return(measurement);
}

String formatMeasurementValue(unsigned char type, float value){  //Converts measurements into valid format
  char measurement [10];  //4B string array for the value.
  measurement[(sizeof(measurement)-1)] = 0; //Put NULL character at the end of the string.

  if (type == TEMPERATURE){
     // -200 ~ 800 -> -20ºC to 80ºC
     itoa((signed short int)(value * 10), measurement, 10);   //Takes the first digit after comma.
  }
  else if (type == HUMIDITY)
  { // 0 ~ 100 ->  0% to 100%
    itoa((unsigned char)(value), measurement, 10);    //Takes only integer part.
  }

  measurement[(sizeof(measurement)-1)] = 0; //Put NULL character at the end of the string
  Serial.printf("\n\nMeasurement:");
  Serial.printf(measurement);
  return( String(measurement) );
}

void* stringToArray(std::string origin_string){
    //This function should return -1 if the size of "a" (destination array) is smaller than "s"
    //to avoid buffer overflow and possible fragmentation faults...
    int string_length = (origin_string.length()) + 1 ;

    char* s = (char*) malloc(string_length);
    strcpy(s, origin_string.c_str());

    return (s);
}

void goDeepSleep(uint64_t time){
  // time is in milliseconds.
  
  if( time > 3600000 ) time = 3600000;  //Maximum 1h (3600 sec).
  
  uint32_t t = time/1000;
 
  rtcmem.setElapsedTime(t + millis()/1000);   //in seconds
  /*  If forced wake up, elapsed time should 
  */
  // rtcmem.setElapsedTime(t + millis()/1000);   //in seconds

  Serial.printf("\nGoing deep sleep for %d seconds... ", (t));

  ESP.deepSleep(time*1000, WAKE_RF_DISABLED);  //deep sleeps for 5 seconds...
}

void setSensorPower(unsigned char state){
  if (state == ON)
  {
    digitalWrite(PWR_SENSORS_PIN_P, LOW);  //Turn sensors supply on.
    digitalWrite(PWR_SENSORS_PIN_N, HIGH);  //Turn sensors supply on.
    // Serial.printf("\nSensors turned on.");
  }
  if (state == OFF)
  {
    digitalWrite(PWR_SENSORS_PIN_P, HIGH);  //Turn sensors supply off.
    digitalWrite(PWR_SENSORS_PIN_N, LOW);  //Turn sensors supply on.
    // Serial.printf("\nSensors turned off.");
  }
}

void wifiTurnOff(void){
  WiFi.disconnect(true);  //Turns off wifi module, so in the wake up it won\\\"t turn on automatically until required.
  delay(1);
  WiFi.mode( WIFI_OFF );  //Wifi starts turned off after wake up, in order to save energy.
  delay(1);
  WiFi.forceSleepBegin(); 
  delay(1);
}

