BrunoRicci/DataloggerDHT22/Firmware/code_esp8266_dht22/src/main.cpp
void wifiTurnOn(void){
  WiFi.forceSleepWake();    //Turns on radio.
  delay(1);   //Necessary delay to settle.
  WiFi.mode(WIFI_STA);  // Bring up the WiFi connection.
  WiFi.persistent(false); //Wifi credentials loaded directly from flash (as specified below) and not overwritten to it.
}

bool initglobals(void){
  /*  Read configuration file (JSON) and load data into Config_globals struct. 
  First load all the data from file into a string, and then parse it to a Json buffer,
  to then extract the values from each keyword.
  If file not found, load default values, defined in this function.
  */

  config_globals = readGlobals();
  
  return false;
}

bool log_event(uint16_t event_type){ 
  /*
    Log timestamp, battery status and event type into flash memory.
  */
  Logs l;
  l.battery_level = getBatteryLevel();    //Current battery level.
  l.timestamp = rtcmem.getCurrentTime();  //Current timestamp.
  l.event_type = event_type;

  File file = SPIFFS.open(LOGS_FILE_NAME, "a");   //Open file to append
  if (file){
    int bytesWritten = file.write((const char*)(&log), sizeof(Logs)); //Overwrites previous data.
    file.close();
    Serial.printf("\nEvent (type %d) logged.", l.event_type);
    return true;
  }
  return false;
}

uint16_t read_log(void* data, uint16_t index, uint16_t amount){
  /*  
    Read "index" amount of logs, starting from the given index.
      If amount is 0, it will return the number of logs saved.
  */

  File file = SPIFFS.open(LOGS_FILE_NAME, "r");   //Open file
  if(file){
    uint16_t size = file.size();

    if(amount == 0 || index >= size) return size;

    if(index+amount >= (size/sizeof(Logs))){   //If size exceeded, amount to read is modified.
      amount = size - index;
    }
    
    if(index + (amount * sizeof(Logs)) >= size){  //Avoid reading illegal values.
      return 0;
    }

    file.seek(index, fs::SeekSet);    //Move the cursor "index" bytes from the beginning.
    uint16 currpos = file.position();
    Serial.printf("\ncurrpos = %d\n", currpos);
    for (uint16 i = 0; i < (amount * sizeof(Logs)); i++)  //Read "bytes" number of bytes from the index position. 
    {
      ((uint8_t*)data)[i] = file.read(); 
    } 
    file.close();    //Close file.
    return amount;
  }
  else{
    Serial.printf("Failed to open [%s] file for reading", LOGS_FILE_NAME);
    return 0;
  }
}
 
bool saveGlobals(void){
  /*
    SEE HOW TO SAVE TO EEPROM... (?)
  */
  Config_globals* g = &config_globals;

  File file = SPIFFS.open(CONFIG_FILE_NAME, "w");   //Open file
  if (file){
    int bytesWritten = file.write((const char*)(g), sizeof(Config_globals)); //Overwrites previous data.
    file.close();
    return true;
  }
  return false;
}

Config_globals readGlobals(void){
  Config_globals g;

  uint8_t buf[sizeof(Config_globals)]; //temporary buffer.

  File file = SPIFFS.open(CONFIG_FILE_NAME, "r");   //Open file
  if (file){        //If file opens correctly...
    // Serial.print("\n  Config_globals: ");  
    for (uint16_t i = 0; i < sizeof(buf); i++)
    {
      buf[i] = file.read(); //Copies the read byte 
      // Serial.printf("%X ",  buf[i]);
    } 
    file.close();
    memcpy(&g, buf, sizeof(buf));  //Copies read data to the variable.
    // rwVariables();  //Stores read data to RTC memory.    ////////////////// REMOVED FOR TESTING ///////////
    return g;
  }
  else{     //Load default values.
    strcpy(config_globals.network_ap_ssid,"DATALOGGER SERVER");
    strcpy(config_globals.network_ap_pass,"!UBA12345!");
    strcpy(config_globals.server_ip, "192.168.123.123");
    strcpy(config_globals.local_ip,"192.168.123.2");
    strcpy(config_globals.wifi_security_type,"WPA2");
    strcpy(config_globals.send_measurements_path, SEND_MEASUREMENTS_PATH);
    strcpy(config_globals.get_time_path, GET_TIME_PATH);


    config_globals.server_port=8080;
    config_globals.server_connection_retry=2;
    config_globals.network_connection_timeout=10000;
    config_globals.server_connection_timeout=2000;
    config_globals.response_timeout=5000;
    config_globals.id_transceiver=0;
    config_globals.id_sensor_a=1;
    config_globals.id_sensor_b=2;
    config_globals.id_sensor_c=3;
    config_globals.id_sensor_d=4;
    config_globals.sample_time=3600;
    config_globals.connection_time[0]=13;  //6:30 a.m. UTC
    config_globals.connection_time[1]=0;

    saveGlobals();
  }
}


//////////////////////////// WEB SERVER FUNCTIONS /////////////////////////////////
unsigned char runWebServer(void){ 

  String ap_ssid="Datalogger";
  String ap_pssw="123456789!";
  
  IPAddress local_IP(192,168,0,170);  //192.168.0.170
  IPAddress gateway(192,168,0,1);   //192.168.0.1
  IPAddress subnet(255,255,255,0);  //255.255.255.255
  WiFi.softAPConfig(local_IP, gateway, subnet);
  WiFi.mode(WIFI_AP);
  while(!WiFi.softAP(ap_ssid, ap_pssw))
  {
    Serial.println(".");
    delay(100);
  }
 
 
  // wifiTurnOn();
  // WiFi.config(local_IP, gateway, subnet);
  // WiFi.begin(config_globals.network_ap_ssid, config_globals.network_ap_pass);
  // while(WiFi.status() != WL_CONNECTED){ //Blocks until Wifi is connected. 
  //   digitalWrite(LED_B_PIN, LOW); //Blink GREEN led.
  //   delay(50);
  //   digitalWrite(LED_B_PIN, HIGH);  
  //   yield(); 
  // }

  LED_Color(COLOR_YELLOW); //Turns on red LED.
  //analogWriteFreq(5);   //See minimum frequency

  // start server
  server.begin();
  Serial.println("HTTP server started");

  Serial.println("");
  Serial.print("Initialized AP:\t");
  Serial.println(ap_ssid);
  Serial.print("IP address:\t");
  Serial.println(WiFi.softAPIP());
  Serial.print("MAC address:\t");
  Serial.println(WiFi.macAddress());
 
  
  server.on("/",handleHome);
  server.on("/change_network_config", handleChangeNetworkConfig);
  server.on("/change_server_config", handleChangeServerConfig);
  server.on("/format_ram",handleFormatRam);
  server.on("/format_flash",handleFormatFlash);
  server.on("/reset_archive_sent_pointer",handleResetSentPointer);
  server.on("/device_turn_off",handleTurnOffDevice);
  server.on("/get_parameters",handleGetParameters);
  server.on("/device_config",handleChangeConfig);

  return(1);
}

